//*--------------------------------------------------------------------
//*-------------------------->> ACFRPTXR <<----------------------------
//*--------------------------------------------------------------------
//REPORT EXEC PGM=ACFRPTXR
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=SYSDA,SPACE=(CYL,(2,0))
//SYSUT2 DD UNIT=SYSDA,SPACE=(CYL,(2,0))
//SYSIN  DD *
ACF2
NOLID
DSET
DSN(SYS1.PARMLIB)
RKEY(SYS1)
NORRSUM
//*
