)ATTR
   _ TYPE(INPUT) PAD(' ')
   + TYPE(TEXT) SKIP(ON) INTENS(LOW)
   # TYPE(OUTPUT) INTENS(HIGH) SKIP(ON) CAPS(OFF)
   @ TYPE(OUTPUT) INTENS(LOW)  SKIP(ON)
   $ AREA(SCRL) EXTEND(ON)
)BODY WIDTH(80) EXPAND("")
%"-" Security Readiness Review Self-Audit "-"+
%" "Asset Definition Process" "+
@PGM8     %       " "Version:@SRRVERS +
%
%ENTER +To scroll forward.  %PF3  +To Exit/Return.
%PF11  +To scroll forward.  %PF10 +To scroll backward.
$HELPSCR ----------------------------------------------------------------------$
+
+
+
)AREA HELPSCR DEPTH(5)
+ This Help is used to create a sites asset import file for the web based
+ application that tracks asset vulnerabilities.
+
% Asset Information:
+
+ The%Key Fields+and%Optional key+entries are collected from information
+ available on the system.  The%Additional fields+can be filled in by the
+ System/Security Administrator.  This panel will require that the following
+ fields be specified:
+
+   Classification, MAC, Confidentiality, Status, and Use.
+
+ These fields require that specific values be specified.  The following is a
+ list of the fields and the only values available:
+
+   Classification:  0 - Secret, 1 - Confidential, or 2 - Unclassified
+   MAC:             0 - MAC I, 1 - MAC II, 2 - MAC III
+   Confidentiality: 1 - Public, 2 - Sensitive, 3 - Confidential
+   Status:          1 - Online, 2 - Offline
+   Use:             1 - Production, 2 - Support, 3 - Test/Development
+
% Commands Available for this process:
+
+  %END+   - Escape process without creating or saving any information.
+  %CREATE+- With the information provided, creates the Asset Definition
             dataset and saves the information that is entered on the screen.
+  %SAVE+  - Saves the information that is entered on the screen only.
+
% Downloading Created Asset:
+
+ The file created in this process can be downloaded and imported into the
+ application that tracks asset vulnerabilities.  Use the following steps for
+ downloading:
+
+  1.  At the TSO ready prompt or the ISPF option 6.
+  2.  Initiate the File Transfer Process to transfer from host to PC.
+      (Receive Files From Host)
+  3.  Enter the file CREATEd in this process in the Host-File Name enclosed
+      in quotes.  (e.g.  '&SRRUSER..XMLASSET')
+  4.  Enter a file name, with an%xml+extension in the PC-File Name.
+      (e.g.  d:\asset.xml)
+  5.  Select%Text+for the Transfer Mode.
+  6.  Under Options, specify%ASCII+only, over ASCII CRLF.
+  7.  Save information and initiate the download process.
+
% Importing Created Asset Definition:
+
+ The file created in this process after downloading, the file saved in%4.+
+ above can be imported into the application that tracks asset vulnerabilities.
+ Use the following steps for downloading:
+
+  To be determined at a future date.
+
+
+ End of document.
)END
