)ATTR
 _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)
 # TYPE(OUTPUT) INTENS(HIGH) SKIP(ON) CAPS(OFF)
 @ TYPE(OUTPUT) INTENS(LOW)  SKIP(ON) CAPS(OFF)
)BODY WIDTH(80) EXPAND("")
%"-" Security Readiness Review Self-Audit "-"+
%" "Administration option menu" "+
@PGM8     %" "Version:@SRRVERS +
%Option ===>_ZCMD
%
%
%            A+- Review open PDI finding reports
%
%            B+- Browse current User access lists
%
%            C+- Browse data set SENSITIVE reports
%
%            D+- Edit STARTED TASK list
%
%            E+- Verify and update Authorized user groups
%
%            F+- Asset Definition Process
%
%EXIT +(PF3) to end.
#SRRMSG
)INIT
 .CURSOR = ZCMD
)PROC
  &OPT = TRUNC (&ZCMD, '.')
  &ZTRAIL = .TRAIL
  VER (&OPT,NB,LIST,A,B,C,D,E,F)
)END
