)ATTR
   _ TYPE(INPUT) PAD(' ')
   + TYPE(TEXT) SKIP(ON) INTENS(LOW)
   # TYPE(OUTPUT) INTENS(HIGH) SKIP(ON) COLOR(RED) CAPS(OFF)
   @ TYPE(OUTPUT) INTENS(LOW)  SKIP(ON) CAPS(OFF)
)BODY WIDTH(80) EXPAND("")
%"-" Security Readiness Review Self-Audit "-"+
@PGM8     %" "Version:@SRRVERS +
%
+ A severe error has occurred.  The following steps must be taken.
+
% Variable SRRERR:
#SRRERR
 
% Variable ZERRMSG: #ZERRMSG   %ZERRSM: #ZERRSM
+
% Variable ZERRLM:
#ZERRLM
 
 
% Variable SYSREASON:  #SRRERC
+
% Variable SYSMSGLVL1:
#SRRMSG1
 
 
% Variable SYSMSGLVL2:
#SRRMSG2
 
 
%EXIT +(PF3) to end.
)INIT
)PROC
IF (.RESP = END)   &ZCMD = END
IF (.RESP = EXIT)  &ZCMD = END
IF (.RESP = ENTER) &ZCMD = END
)END
