{
    "Title": "VMware NSX-T SDN Controller Security Technical Implementation Guide",
    "Description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.",
    "Version": "1",
    "Release": "1 ",
    "BenchmarkDate": "30 Mar 2022",
    "ReleaseInfo": "Release: 1 Benchmark Date: 30 Mar 2022",
    "Source": "STIG.DOD.MIL",
    "Notice": "terms-of-use",
    "Rules": [
        {
            "VulnID": "V-251734",
            "RuleID": "SV-251734r810060_rule",
            "StigID": "TSDC-3X-000011",
            "Severity": "medium",
            "Cat": "CAT II",
            "Classification": "",
            "GroupTitle": "SRG-NET-000236-SDN-000365",
            "RuleTitle": "The NSX-T Controller must be configured as a cluster in active/active mode to preserve any information necessary to determine cause of a system failure and to maintain network operations with least disruption to workload processes and flows.",
            "Description": "<VulnDiscussion>Failure in a known state can address safety or security in accordance with the mission needs of the organization. Failure to a known secure state helps prevent a loss of confidentiality, integrity, or availability in the event of a failure of the SDN controller. Preserving network element state information helps to facilitate continuous network operations minimal or no disruption to mission-essential workload processes and flows.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>",
            "VulnDiscussion": "Failure in a known state can address safety or security in accordance with the mission needs of the organization. Failure to a known secure state helps prevent a loss of confidentiality, integrity, or availability in the event of a failure of the SDN controller. Preserving network element state information helps to facilitate continuous network operations minimal or no disruption to mission-essential workload processes and flows.",
            "FalsePositives": "",
            "FalseNegatives": "",
            "Documentable": "false",
            "Mitigations": "",
            "SeverityOverrideGuidance": "",
            "PotentialImpacts": "",
            "ThirdPartyTools": "",
            "MitigationControl": "",
            "Responsibility": "",
            "IAControls": "",
            "CheckText": "From the NSX-T Manager web interface, go to System >> Appliances.\n\nVerify there are three NSX-T Managers deployed, a VIP or external load balancer is configured, and the cluster is in a healthy state. \n\nIf there are not three NSX-T Managers deployed and a VIP or external load balancer configured and the cluster is in a healthy state, this is a finding.",
            "FixText": "To add additional NSX-T Manager appliances do the following:\n\nFrom the NSX-T Manager web interface, go to System >>Appliances, and then click \"Add NSX Appliance\". Supply the required information to add additional nodes as needed, up to three total.\n\nTo configure NSX-T with a cluster VIP or external load balancer do the following:\n\nFrom the NSX-T Manager web interface, go to System >> Appliances, and then click \"Set Virtual IP\", enter a VIP that is part of the same subnet as the other management nodes, and then click \"Save\".\n\nTo configure NSX-T with an external load balancer, setup an external load balancer with the following requirements:\n\n- Configure the external load balancer to control traffic to the NSX Manager nodes.\n- Configure the external load balancer to use the round robin method and configure source persistence for the load balancer's virtual IP.\n- Create or import a signed certificate and apply the same certificate to all the NSX Manager nodes. The certificate must have the FQDN of the virtual IP and each of the nodes in the SAN.\n\nNote: An external load balancer will not work with the NSX Manager VIP. Do not configure an NSX Manager VIP if using an external load balancer.\n\nIf the cluster status is not in a healthy state identify the degraded component on the appliance and troubleshoot the issue with the error information provided.",
            "CCI": "CCI-001665"
        },
        {
            "VulnID": "V-251735",
            "RuleID": "SV-251735r810063_rule",
            "StigID": "TSDC-3X-000020",
            "Severity": "medium",
            "Cat": "CAT II",
            "Classification": "",
            "GroupTitle": "SRG-NET-000512-SDN-001050",
            "RuleTitle": "The NSX-T Controller cluster must  be on separate physical hosts.",
            "Description": "<VulnDiscussion>SDN relies heavily on control messages between a controller and the forwarding devices for network convergence. The controller uses node and link state discovery information to calculate and determine optimum pathing within the SDN network infrastructure based on application, business, and security policies. Operating in the proactive flow instantiation mode, the SDN controller populates forwarding tables to the SDN-aware forwarding devices. At times, the SDN controller must function in reactive flow instantiation mode; that is, when a forwarding device receives a packet for a flow not found in its forwarding table, it must send it to the controller to receive forwarding instructions.\n\nWith total dependence on the SDN controller for determining forwarding decisions and path optimization within the SDN infrastructure for both proactive and reactive flow modes of operation, having a single point of failure is not acceptable. A controller failure with no failover backup leaves the network in an unmanaged state. Hence, it is imperative that the SDN controllers are deployed as clusters on separate physical hosts to guarantee network high availability.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>",
            "VulnDiscussion": "SDN relies heavily on control messages between a controller and the forwarding devices for network convergence. The controller uses node and link state discovery information to calculate and determine optimum pathing within the SDN network infrastructure based on application, business, and security policies. Operating in the proactive flow instantiation mode, the SDN controller populates forwarding tables to the SDN-aware forwarding devices. At times, the SDN controller must function in reactive flow instantiation mode; that is, when a forwarding device receives a packet for a flow not found in its forwarding table, it must send it to the controller to receive forwarding instructions.\n\nWith total dependence on the SDN controller for determining forwarding decisions and path optimization within the SDN infrastructure for both proactive and reactive flow modes of operation, having a single point of failure is not acceptable. A controller failure with no failover backup leaves the network in an unmanaged state. Hence, it is imperative that the SDN controllers are deployed as clusters on separate physical hosts to guarantee network high availability.",
            "FalsePositives": "",
            "FalseNegatives": "",
            "Documentable": "false",
            "Mitigations": "",
            "SeverityOverrideGuidance": "",
            "PotentialImpacts": "",
            "ThirdPartyTools": "",
            "MitigationControl": "",
            "Responsibility": "",
            "IAControls": "",
            "CheckText": "This check must be performed in vCenter.\n\nFrom the vSphere Client, go to Administration >> Hosts and Clusters >> Select the cluster where the NSX-T Managers are deployed >> Configure >> Configuration >> VM/Host Rules.\n\nIf the NSX-T Manager cluster does not have rules applied to it that separate the nodes onto different physical hosts, this is a finding.",
            "FixText": "This fix must be performed in vCenter.\n\nFrom the vSphere Client, go to Administration >> Hosts and Clusters >> Select the cluster where the NSX-T Managers are deployed >> Configure >> Configuration >> VM/Host Rules.\n\nClick \"Add\" to create a new rule.\n\nProvide a name and select \"Separate Virtual Machines\" under Type.\n\nAdd the three NSX-T Manager virtual machines to the list and click \"OK\".",
            "CCI": "CCI-000366"
        }
    ]
}