{"Title": "z/OS IBM CICS Transaction Server for ACF2 Security Technical Implementation Guide", "Description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.", "Version": "6", "Release": "7 ", "BenchmarkDate": "23 Nov 2022", "ReleaseInfo": "Release: 7 Benchmark Date: 23 Nov 2022", "Source": "STIG.DOD.MIL", "Notice": "terms-of-use", "Rules": [{"VulnID": "V-224302", "RuleID": "SV-224302r520228_rule", "StigID": "ZCIC0010", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000259", "RuleTitle": "CICS system data sets are not properly protected.", "Description": "<VulnDiscussion>CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Unauthorized access to CICS system data sets (i.e., product, security, and application libraries) could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Unauthorized access to CICS system data sets (i.e., product, security, and application libraries) could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)\tRefer to the following report produced by the Data Set and Resource Data Collection:\n\n-\tSENSITVE.RPT(CICSRPT)\n\nSince it is possible to have multiple CICS regions running on an LPAR, it is recommended that you go into the z/OS STIG Addendum and fill out all the information in the \"CICS System Programmers Worksheet\" for each CICS region running on your LPAR. It is recommended that you save this information for any other CICS vulnerabilities that will require it.\n\nb)\tWRITE and/or ALLOCATE access to CICS system data sets is restricted to systems programming personnel.\n\nc)\tIf (b) is true, there is NO FINDING.\n\nd)\tIf (b) is untrue, this is a FINDING.", "FixText": "Review the access authorizations for CICS system data sets for each region.  Ensure they conform to the specifications below:\n\nA CICS environment may include several data set types required for operation.  Typically they are CICS product libraries, which are usually included in the STEPLIB concatenation but may be found in DD DFHRPL.  CICS system data sets that can be identified with DFH DD statements, other product system data sets, and application program libraries. Restrict alter and update access to CICS program libraries and all system data sets to systems programmers only.  Other access must be documented and approved by the IAO.  The site may determine access to application data sets included in the DD DFHRPL and CICS region startup JCL according to need.  Ensure that procedures are established; documented, and followed that prevents the introduction of unauthorized or untested application programs into production application systems.", "CCI": "SV-7978,V-7516,CCI-001499"}, {"VulnID": "V-224303", "RuleID": "SV-224303r868095_rule", "StigID": "ZCIC0020", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000080", "RuleTitle": "Sensitive CICS transactions are not protected in accordance with security requirements.", "Description": "<VulnDiscussion>Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS. These transactions must be protected so that only authorized users can access them. Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS. These transactions must be protected so that only authorized users can access them. Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a) Refer to the following report produced by the ACF2 Data Collection and Data Set and Resource Data Collection:\n\n- SENSITVE.RPT(TRANS)\n- ACF2CMDS.RPT(RESOURCE) - Alternate report\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb) Browse the data set allocated by the ACF2PARM DD statement in each CICS startup procedure. Determine the resource type for transactions. Example:\n\nCICSKEY OPTION=VALIDATE,TYPE=resource type, RESOURCE=TRANS\n\nc) Ensure the following items are in effect for all CICS transactions for each resource type:\n\nNOTE:  Authorized personnel include systems programming and security staffs. Additional guidance regarding authorized personnel for specific transactions is included in this z/OS STIG Addendum. For example, CEMT SPI provides a broader use of this sensitive transaction by restricting execution to inquiries.\n\n1) Transactions, listed in tables CICS CATEGORY 2 CICS AND OTHER PRODUCT TRANSACTIONS and CICS CATEGORY 4 COTS-SUPPLIED SENSITIVE TRANSACTIONS, in the z/OS STIG Addendum, are restricted to authorized personnel.\n\nNote: The exception to this is the CEOT and CSGM transactions, which can be made available to all users.\nNote: The exception to this is the CWBA transaction, can be made available to the CICS Default user.\nNote: The transactions beginning with \"CK\" apply to regions running WebSphere MQ.\nNote: Category 1 transactions are internally restricted to CICS region userids.\n \nd) If (c) is true for all CICS regions, there is no finding.\n\ne) If (c) is untrue for any CICS region, this is a finding.", "FixText": "The ISSO will ensure that each CICS region is  associated with a unique userid and that userid is properly defined.\n\nDevelop a plan to implement the required changes.\n\n1. Most transactions are protected in groups. An example would be \"KT2\" which would contain all Category 2 transactions. KT2 is defined to ACF2 as a resource and contains all the Category 2 transactions.\n\nAn example of how to implement this within ACF2 is shown here:\n\n$KEY(CEMT) TYPE(KT2)          \n  UID(syspaudt) ALLOW     \n UID(*) PREVENT              \n\n2. Transactions groups should be defined and permitted in accordance with the CICS Transaction tables listed in the z/OS STIG Addendum.", "CCI": "SV-251,V-251,CCI-000213"}, {"VulnID": "V-224304", "RuleID": "SV-224304r868098_rule", "StigID": "ZCIC0030", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000480", "RuleTitle": "CICS System Initialization Table (SIT) parameter values must be specified in accordance with proper security requirements.", "Description": "<VulnDiscussion>The CICS SIT is used to define system operation and configuration parameters of a CICS system. Several of these parameters control the security within a CICS region. Failure to code the appropriate values could result in unexpected operations and degraded security. This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "The CICS SIT is used to define system operation and configuration parameters of a CICS system. Several of these parameters control the security within a CICS region. Failure to code the appropriate values could result in unexpected operations and degraded security. This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "Refer to the following report produced by the z/OS Data Collection:\n\n- EXAM.RPT(CICSPROC)\n\nRefer to the following report produced by the CICS Data Collection:\n\n- CICS.RPT(DFHSITxx)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nRefer to the CICS region SYSLOG - (Alternate source of SIT parameters) be sure to process DFHSIT based on the order specified. The system initialization parameters are processed in the following order, with later system initialization parameter values overriding those specified earlier. CICS system initialization parameters are specified in the following ways:\n\n- In the system initialization table, loaded from a library in the STEPLIB concatenation of the CICS startup procedure.\n- In the PARM parameter of the EXEC PGM=DFHSIP statement of the CICS startup procedure.\n- In the SYSIN data set defined in the startup procedure (but only if SYSIN is coded in the PARM parameter).\n- In the ACF2PARM data set defined in the startup procedure.\n\nEnsure the following CICS System Initialization Table (SIT) parameter settings are specified for each CICS region. If the following guidance is true, this is not a finding.\n\n___ SEC=YES - If SEC is not coded in the CICS region startup JCL, go to offset x'117' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the security byte flag. Below is the hex and bit settings for this flag.\n\nX'80' EQU B'10000000' External Security Requested\n\n___ DFLTUSER=<parameter> - If DFLTUSER is not coded in the CICS region startup JCL, go to offset x'118' from the beginning on the SIT dump (record sequence number - 6) for a length of 8 bytes. The value will be the CICS default userid. ACF2PARM overrides the CICS SIT DFLTUSER parameter value with the logonid supplied in the ACF2PARM DEFAULT TERMINAL= parameter.\n\n___ XUSER=YES - If XUSER is not coded in the CICS region startup JCL, go to offset x'117' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the security byte flag. Below is the hex and bit settings for this flag.\n\nX'04' EQU B'00000100' Surrogate User Checking required\n\nThe CICS interface now controls this DFHSIT keyword via the INITIAL XUSER= initialization parameter. The CICS interface dynamically sets this DFHSIT setting during initialization processing using the value specified via the ACF2PARM parameter file. This overrides any value specified by the CICS systems programmer via the CICS SYSIN file, execution parameter overrides, or the DFHSIT table itself so that it is the security administrator and not the CICS systems programmer that controls surrogate userid checking\n\n___ SNSCOPE=NONE|CICS|MVSIMAGE|SYSPLEX - If SNSCOPE is not coded in the CICS region startup JCL, go to offset x'124' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the signon scope byte flag. Ensure that users cannot sign on to more than one CICS production region within the scope of a single CICS region, a single z/OS image, or a sysplex. Below are listed the hex and bit settings for this flag:\n\nX'01' EQU 1 SIGNON SCOPE = NONE\nX'02' EQU 2 SIGNON SCOPE = CICS\nX'03' EQU 3 SIGNON SCOPE = MVSIMAGE\nX'04' EQU 4 SIGNON SCOPE = SYSPLEX\n\nNOTE: SNSCOPE=NONE is only allowed with test/development regions.", "FixText": "Ensure that CICS System Initialization Table (SIT) parameter values are specified using the following guidance.\n\nThe system initialization parameters are processed in the following order, with later system initialization parameter values overriding those specified earlier. CICS system initialization parameters are specified in the following ways:\n\n- In the system initialization table, loaded from a library in the STEPLIB concatenation of the CICS startup procedure.\n- In the PARM parameter of the EXEC PGM=DFHSIP statement of the CICS startup procedure.\n- In the SYSIN data set defined in the startup procedure (but only if SYSIN is coded in the PARM parameter).\n- In the ACF2PARM data set defined in the startup procedure.\n\nEnsure the following CICS System Initialization Table (SIT) parameter settings are specified for each CICS region:\n\nSEC=YES - If SEC is not coded in the CICS region startup JCL, go to offset x'117' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the security byte flag. Below are listed the hex and bit settings for this flag. \n\nX'80' EQU B'10000000' External Security Requested <<===\nX'40' EQU B'01000000' Resource Prefix Required\nX'10' EQU B'00010000' RACLIST class APPCLU required\nX'08' EQU B'00001000' ESM INSTLN data is required\nX'04' EQU B'00000100' Surrogate User Checking required\nX'02' EQU B'00000010' Always enact resource check\nX'01' EQU B'00000001' Always enact command check\n\nDFLTUSER=<parameter> - If DFLTUSER is not coded in the CICS region startup JCL, go to offset x'118' from the beginning on the SIT dump (record sequence number - 6) for a length of 8 bytes. The value will be the CICS default userid.\n\nXUSER=YES - If XUSER is not coded in the CICS region startup JCL, go to offset x'117' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the security byte flag. Below are listed the hex and bit settings for this flag.\n\nX'80' EQU B'10000000' External Security Requested\nX'40' EQU B'01000000' Resource Prefix Required\nX'10' EQU B'00010000' RACLIST class APPCLU required\nX'08' EQU B'00001000' ESM INSTLN data is required\nX'04' EQU B'00000100' Surrogate User Checking required <<===\nX'02' EQU B'00000010' Always enact resource check\nX'01' EQU B'00000001' Always enact command check\n\nSNSCOPE=NONE|CICS|MVSIMAGE|SYSPLEX - If SNSCOPE is not coded in the CICS region startup JCL, go to offset x'124' from the beginning on the SIT dump (record sequence number - 6) for a length of 1. This is the signon scope byte flag. Ensure that users cannot sign on to more than one CICS production region within the scope of a single CICS region, a single z/OS image, or a sysplex. Below are listed the hex and bit settings for this flag:\n\nX'01' EQU 1 SIGNON SCOPE = NONE\nX'02' EQU 2 SIGNON SCOPE = CICS\nX'03' EQU 3 SIGNON SCOPE = MVSIMAGE\nX'04' EQU 4 SIGNON SCOPE = SYSPLEX\n\nNOTE: SNSCOPE=NONE is only allowed with test/development regions.", "CCI": "SV-302,V-302,CCI-000366"}, {"VulnID": "V-224305", "RuleID": "SV-224305r520237_rule", "StigID": "ZCIC0040", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000104", "RuleTitle": "CICS region logonid(s) must be defined and/or controlled in accordance with the security requirements.", "Description": "<VulnDiscussion>CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment.  This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment.  This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)\tRefer to the following report produced by the z/OS Data Collection:\n\n-\tEXAM.RPT(CICSPROC)\n\nRefer to the following report produced by the ACF2 Data Collection:\n\n-\tACF2CMDS.RPT(LOGONIDS)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb)\tEnsure the following items are in effect for each CICS region logonid:\n\n1)\tA unique logonid is associated with the CICS region.\n2)\tThe CICS region logonid has the ACF2CICS, MUSASS, and NO-SMC attributes specified.\nNOTE:\tThe ACF2CICS privilege will be restricted to CICS region logonids only.\n3)\tIf CICS region submits jobs on behalf of its users, the JOBFROM attribute is specified.\n4)\tIf CICS region has a requirement to update information in the ACF2 database, the MUSUPDT attribute is specified.\n5)\tNot granted the ACF2 NON-CNCL privilege.\n6)\tNo access to interactive on-line facilities (e.g., TSO) other than CICS.\n\nc)\tIf (b) are true, this is not a finding.\n\nd)\tIf (b) is untrue, this is a finding.", "FixText": "The IAO will ensure that each CICS region is associated with a unique userid and that userid is properly defined.\n\nReview all CICS region, default, and end-user userids to ensure they are defined and controlled as required.\n\nEnsure that the following is defined for each CICS region:\n\n1)\tA unique userid is defined.\n\nUse the ACF2 insert command to accomplish this.  A sample command is provided here:\n\nINSERT <cicsregionid> NAME('STC, CICS Region') JOBFROM MUSASS NO-SMC STC ACF2CICS", "CCI": "SV-44,V-44,CCI-000764"}, {"VulnID": "V-224306", "RuleID": "SV-224306r868101_rule", "StigID": "ZCIC0041", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000104", "RuleTitle": "CICS default logonid(s) must be defined and/or controlled in accordance with the security requirements.", "Description": "<VulnDiscussion>CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment. This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment. This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a) Refer to the following report produced by the z/OS Data Collection:\n\n- EXAM.RPT(CICSPROC)\n\nRefer to the following report produced by the ACF2 Data Collection:\n\n- ACF2CMDS.RPT(LOGONIDS)\n- ACF2CMDS.RPT(RESOURCE)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb) Ensure the following items are in effect for the CICS default logonid(s) (i.e., Browse the ACF2PARM DD statement for DEFAULT TERMINAL=<parameter> and DEFAULT NONTERMINAL=nnnnnnnn):\n\n1) Not granted the ACF2 NON-CNCL privilege.\n2) No access to interactive on-line facilities (e.g., TSO) other than CICS.\n3) IDLE(15) field is set to 15 minutes.\n4) A system's default time for terminal lock-out or session termination may be lengthened to 30 minutes at the discretion of the ISSM. The ISSM will maintain the documentation for each system with a time-out adjusted beyond the 15-minute recommendation to explain the basis for this decision.\n\n5) Restricted from accessing all data sets and resources with the following exceptions:\n\n(a) Non-restricted CICS transactions (e.g., CESF, CESN, 'good morning' transaction, etc.)\n(b) If applicable, resources necessary to operate in an intersystem communication (ISC) environment (i.e., LU6.1, LU6.2, and MRO)\n\n(c) If all items in (b) are true, this is not a finding.\n(d) If any item in (b) is untrue, this is a finding.", "FixText": "Ensure that the default CICS user is restricted and properly defined.\n\nEnsure the following items are in effect for the CICS default logonid(s) (i.e., Browse the ACF2PARM DD statement for DEFAULT TERMINAL=<parameter> and DEFAULT NONTERMINAL=nnnnnnnn):\n\nNot granted the ACF2 NON-CNCL privilege.\nUse the ACF2 LIST command to display the default CICS userid.\n\nExample:\nSET LID\nLIST CICS\nCHANGE CICS NONON-CNCL\n\nNo access to interactive online facilities (e.g., TSO) other than CICS.\n\nUse the ACF2 LIST command to display the default CICS userid.\n\nExample:\nSET LID\nLIST CICS\nCHANGE CICS NOTSO\n\nIDLE(15) field is set to 15 minutes, up to 30 with justification.\nUse the ACF2 LIST command to display the default CICS userid.\n\nExample:\n\nSET LID\nLIST CICS\nCHANGE CICS IDLE(15) up to 30 with justification\n\nRestricted from accessing all data sets and resources with the following exceptions:\n\nNon-restricted CICS transactions (e.g., CESF, CESN, 'good morning' transaction, etc.)\n\nIf applicable, resources necessary to operate in an intersystem communication (ISC) environment (i.e., LU6.1, LU6.2, and MRO)\n\nUse the ACF2 ACFRPTRX or ACFRPTXR reports to verify if the CICS default userid has access to any resources or datasets.", "CCI": "SV-7523,V-7119,CCI-000764"}, {"VulnID": "V-224307", "RuleID": "SV-224307r520243_rule", "StigID": "ZCIC0042", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000029", "RuleTitle": "CICS logonid(s) must be configured with proper timeout and signon limits.", "Description": "<VulnDiscussion>CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment.  This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Improperly defined or controlled CICS userids (i.e., region, default, and terminal users) may provide an exposure and vulnerability within the CICS environment.  This could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)       Refer to the following report produced by the ACF2 Data Collection:\n\n-       ACF2CMDS.RPT(LOGONIDS)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nNote: Any logonid that does not have an IDLE value specified will obtain its IDLE value from the default value set in ZCIC0041. Any logonid that specifies an IDLE value must meet the requirements specified below.\n\nb) For all logonids with the CICS attribute that have IDLE(15) specified this is not a finding.\n\nNOTE: If the time-out limit is greater than 15 minutes, and the system is processing unclassified information, review the following items. If any of these is true, this is not a finding.\n\nIf a session is not terminated, but instead is locked out after 15 minutes of inactivity, a process must be in place that requires user identification and authentication before the session is unlocked. Session lock-out will be implemented through system controls or terminal screen protection.\nA system's default time for terminal lock-out or session termination may be lengthened to 30 minutes at the discretion of the ISSM. The ISSM will maintain the documentation for each system with a time-out adjusted beyond the 15-minute recommendation to explain the basis for this decision.\nThe ISSM may set selected userids to have a time-out of up to 60 minutes in order to complete critical reports or transactions without timing out. Each exception must meet the following criteria:\n\n        The time-out exception cannot exceed 60 minutes.\n        A letter of justification fully documenting the user requirement(s) must be submitted and approved by the site IAM. In addition, this letter must identify an alternate means of access control for the terminal(s) involved (e.g., a room that is locked at all times, a room with a cipher lock to limit access, a password protected screen saver set to 30 minutes or less, etc.). The requirement must be revalidated on an annual basis.\n\n\nc) If the MULTSIGN option in the  logonid record field is restricted to test or development use, this is not a finding.", "FixText": "Ensure that all userids with a CICS segment have the TIMEOUT parameter set to 15 minutes.\nEnsure that all LIDs authorized to access a CICS facility restrict MULTSIGN to test and development use.\n\nExamples:\nSET LID\nLIST CICS\nCHANGE CICS IDLE(15)", "CCI": "SV-7524,V-7120,CCI-000057"}, {"VulnID": "V-224308", "RuleID": "SV-224308r520246_rule", "StigID": "ZCICA011", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000259", "RuleTitle": "ACF2/CICS parameter data sets are not protected in accordance with the proper security requirements.", "Description": "<VulnDiscussion>CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Unauthorized access to ACF2/CICS parameter data sets (i.e., product, security) could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "CICS is a transaction-processing product that provides programmers with the facilities to develop interactive applications. Unauthorized access to ACF2/CICS parameter data sets (i.e., product, security) could result in the compromise of the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)\tRefer to the following report produced by the ACF2 Data Collection:\n\n-\tSENSITVE.RPT(CICSRPT)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb)\tUPDATE and/or ALLOCATE access to the ACF2/CICS parameter data set, specified on the ACF2PARM DD statement, is restricted to systems programming personnel and security personnel.\n\nc)\tIf all items in (b) are true, there is NO FINDING.\n\nd)\tIf any item in (b) is untrue, this is a FINDING.", "FixText": "The IAO will ensure that update and allocate access to the ACF2/CICS parameter data set is limited to system programmers and security personnel.\n\nReview the access authorizations for CICS system data sets.\n\nUPDATE and/or ALLOCATE access to the ACF2/CICS parameter data set, specified on the ACF2PARM DD statement, is restricted to systems programming personnel and security personnel.\n\nExample:\n\n$KEY(S3C)    \n$PREFIX(SYS3)\nCICSTS.SYSIN    UID(syspaudt) R(A)  W(L) A(L)  E(A)\nCICSTS.SYSIN    UID(secaaudt) R(A)  W(L) A(L)  E(A)\nCICSTS.SYSIN    UID(*) PREVENT\n\nSET RULE\nCOMPILE 'ACF2.MVA.DSNRULES(S3C)' STORE", "CCI": "SV-7475,V-7091,CCI-001499"}, {"VulnID": "V-224309", "RuleID": "SV-224309r868103_rule", "StigID": "ZCICA021", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000018", "RuleTitle": "IBM CICS Transaction Server SPI command resources must be properly defined and protected.", "Description": "<VulnDiscussion>IBM CICS Transaction Server can run with sensitive system privileges, and potentially can circumvent system controls. Failure to properly control access to product resources could result in the compromise of the operating system environment, and compromise the confidentiality of customer data. Many utilities assign resource controls that can be granted to system programmers only in greater than read authority. Resources are also granted to certain non systems personnel with read only authority.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "IBM CICS Transaction Server can run with sensitive system privileges, and potentially can circumvent system controls. Failure to properly control access to product resources could result in the compromise of the operating system environment, and compromise the confidentiality of customer data. Many utilities assign resource controls that can be granted to system programmers only in greater than read authority. Resources are also granted to certain non systems personnel with read only authority.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "Refer to the following report produced by the ACF2 Data Collection and Data Set and Resource Data Collection:\n\n- SENSITVE.RPT(XCMD)\n- ACF2CMDS.RPT(RESOURCE) - Alternate report\n\nAutomated Analysis:\nRefer to the following report produced by the ACF2 Data Collection Checklist:\n- PDI (ZCIC0021)\n\nEnsure that all IBM CICS Transaction Server SPI command resources defined in the IBM CICS-RACF Security Guide are properly protected according to the requirements specified in the site security plan, use CICS SPI Resources table in the zOS STIG Addendum as a guide. If the following guidance is true, this is not a finding.\n\nThe ACF2 resources and/or generic equivalent as designated in the above table are defined with a default access of PREVENT.\n\nThe ACF2 resource access authorizations restrict access to the appropriate personnel as designated in the above table.", "FixText": "Ensure that the IBM CICS Transaction Server SPI command resources defined in the IBM CICS-RACF Security Guide access is in accordance with those outlined in the site security plan use CICS SPI Resources table in the zOS STIG Addendum as a guide.\n\nThese tables list the resources and access requirements for IBM CICS Transaction Server; ensure the following guidelines are followed:\n\nThe ACF2 resources and/or generic equivalent as designated in the above table are defined with a default access of PREVENT.\n\nThe ACF2 resource access authorizations restrict access to the appropriate personnel as designated in the above table.\n\nThe following commands are provided as a sample for implementing resource controls:\n\n$KEY(ASSOCIATION) TYPE(XCD)\n- UID(CICSAUDT) SERVICE(READ) ALLOW\n- UID(CICUAUDT) SERVICE(READ) ALLOW\n- UID(SYSCAUDT) SERVICE(READ) ALLOW\n- UID(*) PREVENT", "CCI": "SV-43206,V-17982,CCI-000035,CCI-002234"}, {"VulnID": "V-224310", "RuleID": "SV-224310r520252_rule", "StigID": "ZCICA022", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000480", "RuleTitle": "CICS startup JCL statement is not specified in accordance with the proper security requirements.", "Description": "<VulnDiscussion>The CICS SIT is used to define system operation and configuration parameters of a CICS system.  Several of these parameters control the security within a CICS region.  Failure to code the appropriate values could result in unexpected operations and degraded security.  This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "The CICS SIT is used to define system operation and configuration parameters of a CICS system.  Several of these parameters control the security within a CICS region.  Failure to code the appropriate values could result in unexpected operations and degraded security.  This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)\tRefer to the following report produced by the z/OS Data Collection:\n\n\t-\tEXAM.RPT(CICSPROC)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb)\tEnsure every CICS region on the system has the ACF2PARM DD statement in the CICS startup JCL.\n\nc)\tIf the item in (b) is true for each CICS region, there is NO FINDING.\n\nd)\tIf the item in (b) is untrue for a CICS region, this is a FINDING.", "FixText": "The IAO will ensure that each CICS region procedure has the ACF2/CICS parameter dataset specified.\n\nEnsure every CICS region on the system has the ACF2PARM DD statement in the CICS startup JCL.\n\nView the started task proc for each CICS region in SYS3.PROCLIB using ISPF.", "CCI": "SV-7188,V-6893,CCI-000366"}, {"VulnID": "V-224311", "RuleID": "SV-224311r868106_rule", "StigID": "ZCICA023", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000480", "RuleTitle": "Key ACF2/CICS parameters must be properly coded.", "Description": "<VulnDiscussion>The ACF2/CICS parameters define the security controls in effect for CICS regions. Failure to code the appropriate values could result in degraded security. This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "The ACF2/CICS parameters define the security controls in effect for CICS regions. Failure to code the appropriate values could result in degraded security. This exposure may result in unauthorized access impacting the confidentiality, integrity, and availability of the CICS region, applications, and customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a) Refer to the following report produced by the z/OS Data Collection:\n\n- EXAM.RPT(CICSPROC)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nRefer to the CICS region SYSLOG - (Alternate source of SIT parameters)\n\nb) Browse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nc) If all key ACF2/CICS parameters for every CICS region are coded as stated in the table entitled ACF2/CICS Parameters in the z/OS STIG Addendum, this is not a finding.\n\nNote: The DEFAULT TERMINAL=parameter must be specified.\nCICSKEY OPTION=VALIDATE,TYPE=resource type,RESOURCE=TRANS will specify a unique resource type for each CICS region.\n\nd) If any key ACF2/CICS parameter is not coded as referenced in (c), this is a finding.", "FixText": "Ensure the ACF2/CICS parameters are coded with values specified in the table entitled ACF2/CICS Parameters, in the zOS STIG Addendum.\n\nBrowse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nEnsure that all key ACF2/CICS parameters for every CICS region are coded as stated in the table entitled ACF2/CICS Parameters, in the zOS STIG Addendum.", "CCI": "SV-8031,V-7554,CCI-000366"}, {"VulnID": "V-224312", "RuleID": "SV-224312r520258_rule", "StigID": "ZCICA024", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000480", "RuleTitle": "Sensitive CICS transactions are not protected in accordance with the proper security requirements.", "Description": "<VulnDiscussion>Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS.  These transactions must be protected so that only authorized users can access them.  Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS.  These transactions must be protected so that only authorized users can access them.  Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a) Refer to the following report produced by the z/OS Data Collection:\n\n- EXAM.RPT(CICSPROC)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb) Browse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nc) Ensure the following items are in effect for entries specified in the SAFELIST parameter:\n\n1) Transactions are uniquely identified.\n2) Transactions are not masked.\n3) Sensitive transactions are not included.\n\nNOTE:  For information on transactions that are eligible for exemption from security checking refer to Category 3 Transactions for CICS TS 3.1 - 5.1 in the z/OS STIG addendum.\nd) If the items in (c) are true for all entries specified in the SAFELIST parameter for each CICS region, there is no finding.\n\ne) If any item in (c) is untrue for any entry specified in the SAFELIST parameter, this is a finding.", "FixText": "The Systems Programmer and IAO will ensure the ACF2/CICS parameter SAFELIST are coded with the values specified below.\n\nBrowse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nEnsure the following items are in effect for entries specified in the SAFELIST parameter: \n\n1) Transactions are uniquely identified.\n2) Transactions are not masked.\n3) Sensitive transactions are not included.\n\nNOTE:  For information on transactions that are eligible for exemption from security checking refer to Category 3 Transactions for CICS TS 3.1 - 5.1 in the z/OS STIG addendum.", "CCI": "SV-7189,V-6894,CCI-000366"}, {"VulnID": "V-224313", "RuleID": "SV-224313r855160_rule", "StigID": "ZCICA025", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-OS-000324", "RuleTitle": "Sensitive CICS transactions are not protected in accordance with the proper security requirements.", "Description": "<VulnDiscussion>Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS.  These transactions must be protected so that only authorized users can access them.  Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "Sensitive CICS transactions offer the ability to circumvent transaction level controls for accessing resources under CICS.  These transactions must be protected so that only authorized users can access them.  Unauthorized use can result in the compromise of the confidentiality, integrity, and availability of the operating system or customer data.", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "a)\tRefer to the following report produced by the z/OS Data Collection:\n\n\t-\tEXAM.RPT(CICSPROC)\n\nRefer to the CICS Systems Programmer Worksheets filled out from previous vulnerability ZCIC0010.\n\nb)\tBrowse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nc)\tIf the PROTLIST parameter is not specified for all CICS regions, there is NO FINDING.\n\nd)\tIf the PROTLIST parameter is specified for any CICS region, this is a FINDING.", "FixText": "The Systems Programmer and IAO will ensure the ACF2/CICS parameter PROTLIST is not coded.\n\nBrowse the ACF2/CICS data set allocated by the ACF2PARM DD statement in the JCL of each CICS procedure.\n\nMake sure the PROTLIST parameter is not specified for all CICS regions.", "CCI": "SV-7191,V-6896,CCI-002235"}]}