{"Title": "Citrix XenDesktop 7.x Receiver Security Technical Implementation Guide", "Description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.", "Version": "1", "Release": "1 ", "BenchmarkDate": "23 Aug 2018", "ReleaseInfo": "Release: 1 Benchmark Date: 23 Aug 2018", "Source": "STIG.DOD.MIL", "Notice": "terms-of-use", "Rules": [{"VulnID": "V-81427", "RuleID": "SV-96141r1_rule", "StigID": "CXEN-RE-000030", "Severity": "high", "Cat": "CAT I", "Classification": "", "GroupTitle": "SRG-APP-000014", "RuleTitle": "Citrix Receiver must implement DoD-approved encryption.", "Description": "<VulnDiscussion>Without confidentiality protection mechanisms, unauthorized individuals may gain access to sensitive information via a remote access session. \n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless. \n\nEncryption provides a means to secure the remote connection to prevent unauthorized access to the data traversing the remote access connection thereby providing a degree of confidentiality. The encryption strength of mechanism is selected based on the security categorization of the information.\n\nSatisfies: SRG-APP-000014, SRG-APP-000015, SRG-APP-000142, SRG-APP-000219, SRG-APP-000416, SRG-APP-000427, SRG-APP-000439, SRG-APP-000440, SRG-APP-000441, SRG-APP-000442, SRG-APP-000514</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "Without confidentiality protection mechanisms, unauthorized individuals may gain access to sensitive information via a remote access session. \n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless. \n\nEncryption provides a means to secure the remote connection to prevent unauthorized access to the data traversing the remote access connection thereby providing a degree of confidentiality. The encryption strength of mechanism is selected based on the security categorization of the information.\n\nSatisfies: SRG-APP-000014, SRG-APP-000015, SRG-APP-000142, SRG-APP-000219, SRG-APP-000416, SRG-APP-000427, SRG-APP-000439, SRG-APP-000440, SRG-APP-000441, SRG-APP-000442, SRG-APP-000514", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "Verify encryption has been enabled on devices running Citrix Receiver:\n\nOpen the Citrix Receiver Group Policy Object administrative template by running gpedit.msc.\n\n1. Launch the Citrix Receiver Group Policy Object administrative template using the Group Policy Management Console.\n2. Under the Computer Configuration node, go to Administrative Templates >> Citrix Receiver >> Network routing and select the TLS and Compliance Mode Configuration policy.\n3. Verify the policy is enabled.\n\nIf the policy is not enabled, this is a finding.\n\n4. Verify the following policy options are selected:\n- Verify \"Require TLS for all connections\" is selected. \n- From the Security Compliance Mode drop-down, verify \"SP800-52\" is selected. \n- Verify \"Full access check and CRL required\" is selected.\n- Verify \"Enable FIPS: is selected.\n- From the Allow TLS Servers drop-down, verify the desired port number is entered.\n- Verify \"TLS 1.2\" is selected.\n- From the TLS cipher suite drop-down, verify \"Select Government (GOV)\" is selected.\n- From the Certificate Revocation Check Policy drop-down, select the policy required by your Organizational Security Policy.\n\nIf any of the policy options noted above are not selected, this is a finding.", "FixText": "As an administrator, open the Citrix Receiver Group Policy Object administrative template by running gpedit.msc.\n\nApply the policy on a domain OU containing User Devices running Windows Receiver. \n1. Launch the Citrix Receiver Group Policy Object administrative template using the Group Policy Management Console.\n2. Under the Computer Configuration node, go to Administrative Templates >> Citrix Receiver >> Network routing and select the TLS and Compliance Mode Configuration policy.\n3. Select \"Enabled\" to enable secure connections and to encrypt communication on the server. Set the following options:\n- Select \"Require TLS\" for all connections to force Citrix Receiver for Windows to use TLS for all connections to published applications and desktops.\n- From the Security Compliance Mode drop-down, select the option:\nSP800-52 – Select SP800-52 for compliance with NIST SP 800-52.\n- Select Full access check and CRL required.\n4. Enable FIPS - Select this option to enforce the use of FIPS-approved cryptography. You must also enable the Windows security option from the operating system group policy, System Cryptography: Use FIPS-compliant algorithms for encryption, hashing, and signing. Otherwise, Citrix Receiver for Windows might fail to connect to published applications and desktops.\n5. From the Allow TLS Servers drop-down, select the port number. Ensure that Citrix Receiver connects only to a specified server by using a comma-separated list. Wildcards and port numbers can be specified. For example, *.citrix.com:4433 allows connections to any server whose common name ends with .citrix.com on port 4433. The issuer of the certificate asserts the accuracy of the information in a security certificate. If Citrix Receiver does not recognize and trust the issuer, the connection is rejected.\n6. From the TLS version drop-down, select \"TLS 1.2\".\n7. TLS cipher suite - Select \"Government (GOV)\"\n8. From the Certificate Revocation Check Policy drop-down, select the policy required by the Organizational Security Policy.", "CCI": "CCI-000068,CCI-000382,CCI-001184,CCI-001453,CCI-002418,CCI-002420,CCI-002421,CCI-002422,CCI-002450,CCI-002470"}, {"VulnID": "V-81429", "RuleID": "SV-96143r1_rule", "StigID": "CXEN-RE-000855", "Severity": "medium", "Cat": "CAT II", "Classification": "", "GroupTitle": "SRG-APP-000391", "RuleTitle": "Citrix Receiver must accept Personal Identity Verification (PIV) credentials.", "Description": "<VulnDiscussion>The use of PIV credentials facilitates standardization and reduces the risk of unauthorized access.\n\nDoD has mandated the use of the CAC to support identity management and personal authentication for systems covered under HSPD 12, as well as a primary component of layered protection for national security systems.\n\nSatisfies: SRG-APP-000391, SRG-APP-000392</VulnDiscussion><FalsePositives></FalsePositives><FalseNegatives></FalseNegatives><Documentable>false</Documentable><Mitigations></Mitigations><SeverityOverrideGuidance></SeverityOverrideGuidance><PotentialImpacts></PotentialImpacts><ThirdPartyTools></ThirdPartyTools><MitigationControl></MitigationControl><Responsibility></Responsibility><IAControls></IAControls>", "VulnDiscussion": "The use of PIV credentials facilitates standardization and reduces the risk of unauthorized access.\n\nDoD has mandated the use of the CAC to support identity management and personal authentication for systems covered under HSPD 12, as well as a primary component of layered protection for national security systems.\n\nSatisfies: SRG-APP-000391, SRG-APP-000392", "FalsePositives": "", "FalseNegatives": "", "Documentable": "false", "Mitigations": "", "SeverityOverrideGuidance": "", "PotentialImpacts": "", "ThirdPartyTools": "", "MitigationControl": "", "Responsibility": "", "IAControls": "", "CheckText": "Verify the policy value for Administrative Templates >> Classic Administrative Templates (ADM) >> Citrix Components >> Citrix Receiver >> User authentication >> \"Local user name and password\" is set to \"Enabled\" with the option \"Enable pass-through authentication\" checked. \n\nIf the \"Local user name and password\" policy is not \"Enabled\" or does not have the \"Enable pass-through authentication\" option checked, this is a finding.", "FixText": "Set the policy value for Administrative Templates >> Classic Administrative Templates (ADM) >> Citrix Components >> Citrix Receiver >> User authentication >> Local user name and password to \"Enabled\" and select the option \"Enable pass-through authentication\".", "CCI": "CCI-001953,CCI-001954"}]}